# RbsElecPanelTotalestloadLightParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecPanelTotalestloadLightParam Property
ParameterTypeId Class See Also
---
"Lighting Total Estimated Demand"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecPanelTotalestloadLightParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecPanelTotalestloadLightParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecPanelTotalestloadLightParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace